{"identification":{"description":"Facility-level accruing fees.","publicationDate":"2015-07-15","shortName":"accruingFeeTypeScheme","version":"1-0","canonicalUri":"http://www.fpml.org/coding-scheme/accruing-fee-type","canonicalVersionUri":"http://www.fpml.org/coding-scheme/accruing-fee-type-1-0","locationUri":"http://www.fpml.org/coding-scheme/accruing-fee-type-1-0.xml"},"codes":[{"value":"Commitment","description":"A fee paid by the borrower to keep loan in place until it can be used.                    For a revolver, the fee paid by a borrower on unused/funded                    commitments.","source":"FpML","effectiveDate":"2015-07-15"},{"value":"Facility","description":"A fee that is paid on a facility's entire committed amount, regardless of                    usage; it is often charged on revolving credits to investment grade borrowers                    instead of a commitment fee because these facilities typically have a                    competitive-bid option (CBO) that allows a borrower to solicit the best bid from                    it syndicate group for a given borrowing. The lenders that do not lender until                    the CBO are still paid for their commitment.","source":"FpML","effectiveDate":"2015-07-15"},{"value":"Ticking","description":"A fee associated with a long-term commitment to provide a Bridge Loan or                    Credit Facility, which starts accruing the day the Fee Letter is signed (or a                    specified number of days thereafter) and terminates when the underlying                    transaction is either consummated or terminated. The Ticking Fee is set forth in                    the Fee Letter. ","source":"FpML","effectiveDate":"2015-07-15"},{"value":"Utilization","description":"Calculated as a percentage of the utilized portion of the facility. This                    fee type is subject to banding rules - different portions of the utilization                    amount may be subject to different percentages.","source":"FpML","effectiveDate":"2015-07-15"}]}