{"identification":{"description":"The type of cash flows associated with OTC derivatives contracts and their            lifecycle events.","shortName":"cashflowTypeScheme","version":"2-0","canonicalUri":"http://www.fpml.org/coding-scheme/cashflow-type","canonicalVersionUri":"http://www.fpml.org/coding-scheme/cashflow-type-2-0","locationUri":"http://www.fpml.org/coding-scheme/cashflow-type-2-0.xml"},"codes":[{"value":"AmendmentFee","description":"A cash flow associated with an amendment lifecycle event.","source":"FpML"},{"value":"AssignmentFee","description":"A cash flow resulting from the assignment of a contract to a new                    counterparty.","source":"FpML"},{"value":"Coupon","description":"A cash flow corresponding to the periodic accrued interests.","source":"FpML"},{"value":"CreditEvent","description":"A cashflow resulting from a credit event.","source":"FpML"},{"value":"DividendReturn","description":"A cash flow corresponding to the synthetic dividend of an equity                    underlyer asset traded through a derivative instrument.","source":"FpML"},{"value":"ExerciseFee","description":"A cash flow associated with an exercise lifecycle event.","source":"FpML"},{"value":"Fee","description":"A generic term for describing a non-scheduled cashflow that can be                    associated either with the initial contract, with some later corrections to it                    (e.g. a correction to the day count fraction that has a cashflow impact) or with                    some lifecycle events. Fees that are specifically associated with termination                    and partial termination, increase, amendment, and exercise events are qualified                    accordingly.","source":"FpML"},{"value":"IncreaseFee","description":"A cash flow associated with an increase lifecycle event.","source":"FpML"},{"value":"InterestReturn","description":"A cash flow corresponding to the return of the interest rate portion of a                    derivative instrument that has different types of underlying assets, such as a                    total return swap.","source":"FpML"},{"value":"PartialTerminationFee","description":"A cash flow associated with a partial termination lifecycle                    event.","source":"FpML"},{"value":"Premium","description":"The premium associated with an OTC contract such as an option or a                    cap/floor.","source":"FpML"},{"value":"PriceReturn","description":"A cash flow corresponding to the return of the price portion of a                    derivative instrument that has different types of underlying assets, such as a                    total return swap.","source":"FpML"},{"value":"PrincipalExchange","description":"A cash flow which amount typically corresponds to the notional of the                    contract and that is exchanged between the parties on trade inception and                    reverted back when the contract is terminated.","source":"FpML"},{"value":"TerminationFee","description":"A cash flow associated with a termination lifecycle event.","source":"FpML"}]}