{"identification":{"description":"Various features associated with a given facility.","publicationDate":"2019-10-31","shortName":"facilityFeatureScheme","version":"1-1","canonicalUri":"http://www.fpml.org/coding-scheme/facility-feature","canonicalVersionUri":"http://www.fpml.org/coding-scheme/facility-feature-1-1","locationUri":"http://www.fpml.org/coding-scheme/facility-feature-1-1.xml"},"codes":[{"value":"ABL","description":"Asset -Based Loan (ABL): a loan that is secured by specific assets                    (typically receivables or inventory) an made on the basis of a borrowing formula                    (borrowing base) that reflects a percentage of the value of such                    assets.","source":"FpML","effectiveDate":"2019-10-31"},{"value":"Acquisition","description":"A specific type of loan that typically cannot be reborrowed. Funds can be                    drawn down from the line of credit only for a specific period of time and only                    to purchase specified assets.","source":"FpML","effectiveDate":"2019-10-31"},{"value":"Add-On","description":"An increase to an existing facility.","source":"FpML","effectiveDate":"2019-10-31"},{"value":"Advance","description":"An individual borrowing under a credit facility.","source":"FpML","effectiveDate":"2019-10-31"},{"value":"BankersAcceptance","description":"A promised future payment, or time draft, which is accepted and                    guaranteed by a bank and drawn on a deposit at the bank. The banker's acceptance                    specifies the amount of money, the date, and the person to which the payment is                    due. After acceptance, the draft becomes an unconditional liability of the bank.                    But the holder of the draft can sell (exchange) it for cash at a discount to a                    buyer who is willing to wait until the maturity date for the funds in the                    deposit.","source":"FpML","effectiveDate":"2019-10-31"},{"value":"Bridge","description":"A Credit Facility pursuant to which Lenders make Bridge Loans which are                    short-term loans (generally maturing in one year) that typically (although not                    always) are not intended to be funded. The purpose of the Bridge Loan is to                    provide a bidder with a committed financing in the context of an action for a                    business in case the Notes offering contemplated as part of the acquisition                    financing cannot be consummated prior to the consumption of the acquisition                    (i.e., to bridge the gap in financing). Traditionally, Bridge Loans are used                    by Financial Buyers (Sponsors) in auction situations, but corporate buyers also                    sometimes use Bridge Loans to finance acquisitions. ","source":"FpML","effectiveDate":"2019-10-31"},{"value":"Capex","description":"A facility whose loans are used to fund capital expenditures which are                    defined as any expenditure in respect of a capital asset of the borrower, i.e.,                    an expenditure that does not flow through the borrower's income                    statement.","source":"FpML","effectiveDate":"2019-10-31"},{"value":"DIP","description":"Debtor-In-Possession (DIP Loan Facility: A credit agreement entered into                    by a borrower during the course of its Chapter 11 bankruptcy case, which is                    secured and has priority over existing debt and other claims. ","source":"FpML","effectiveDate":"2019-10-31"},{"value":"Exit","description":"Financing that takes place when a debtor is ready to confirm a plan and                    exit Bankruptcy. It is through Exit Financing that the debtor is able to fund                    its plan of reorganization. In most, if not all, plans of reorganization, Exit                    Financing is required to be available before a debtor can reach the effective                    date for its plan. ","source":"FpML","effectiveDate":"2019-10-31"},{"value":"Extended","description":"Credit Facility that is extended beyond its original maturity date. When                    all or a portion of the initial facilitiy remains and is not extended, the                    extended portion becomes a new facility. ","source":"FpML","effectiveDate":"2019-10-31"},{"value":"Guarantee","description":"A Guarantor's agreement to purchase or otherwise become contingently                    liable for the debts or other obligations of another entity. With respect to a                    group of companies guarantees can be upstream (a subsidiary guaranteeing debt                    of its parent), cross-stream (a subsidiary guaranteeing debt of a sister                    company, where both are ultimately owned by the same parent) and downstream (a                    parent guaranteeing debt of a subsidiary).","source":"FpML","effectiveDate":"2019-10-31"},{"value":"Incremental","description":"A post-Closing addition to an existing Credit Facility on substantially                    the same terms as the existing Credit Facility, typically used to finance                    acquisitions, investments or even dividends. The existing Lenders do not                    precommit to provide the Incremental Facility, but do pre-approve the                    incremental leverage. At the time the Borrower desires to add on to the existing                    Credit Facility, it must seek new commitments from existing or new Lenders.                    Incremental Facility debt is additional Secured Debt that shares Collateral with                    the pre-existing First or Second Lien Debt. ","source":"FpML","effectiveDate":"2019-10-31"},{"value":"Mezzanine","description":"An unsecured debt instrument with certain equity-like characteristics.                    The Mezzanine component of a capital structure is subordinate in right of                    payment to Senior Debt and carries a coupon similar to high yield bonds.                    Mezzanine debt is often issued at the holdco level. Mezzanine debt often has                    equity features, frequently referred to as equity kickers, which may take the                    form of warrants that permit the holder to purchase equity at a preset price, or                    conversion features upon certain events (such as change of control). The                    combination of the debt coupon and the equity kicker gives Mezzanine investors a                    higher return than high yield bonds. ","source":"FpML","effectiveDate":"2019-10-31"},{"value":"Non-Extended","description":"Credit Facility that is not extended beyond its original maturity                    date.","source":"FpML","effectiveDate":"2019-10-31"},{"value":"PIK","description":"Payment in Kind interest is a form of payment where the interest owed                    by the borrower is added to the principal amount owed to a lender. A separate                    PIK facility is comprised of this interest.","source":"FpML","effectiveDate":"2019-10-31"},{"value":"PIKToggle","description":"An interest rate feature that gives the Borrower the option to pay all,                    half or none of the interest for any period (generally during a non-call period)                    in kind. Typically, an interest rate step up will apply to any portion of                    interest that is paid in kind. PIK Toggles are attractive to Borrowers because                    of the ability to toggle out of cash interest payments in times of a liquidity                    crunch - meaning if the Borrower is short on cash, it can stop making cash                    interest payments and just let the interest PIK.","source":"FpML","effectiveDate":"2019-10-31"},{"value":"Synthetic","description":"Typically refers to letters of credit.","source":"FpML","effectiveDate":"2019-10-31"},{"value":"Unitranche","description":"A hybrid loan facility structure that combines senior debt and                    subordinated debt into one facility bearing a blended interest rate. This type                    of financing is mainly aimed at middle market companies and used by private                    equity in leveraged buyouts.","source":"FpML","effectiveDate":"2019-10-31"}]}