{"identification":{"description":"Defines the type of each scheduled date that is            reported.","shortName":"scheduledDateTypeScheme","version":"1-0","canonicalUri":"http://www.fpml.org/coding-scheme/scheduled-date-type","canonicalVersionUri":"http://www.fpml.org/coding-scheme/scheduled-date-type-1-0","locationUri":"http://www.fpml.org/coding-scheme/scheduled-date-type-1-0.xml"},"codes":[{"value":"AccrualStart","description":"Date interest first starts accruing. In most cases, this will be the                    effective date.","source":"FpML"},{"value":"Effective","description":"The effective date of the swap leg. This is useful when the information                    is not directly included in the swap stream (for example, in certain equity                    swaps).","source":"FpML"},{"value":"FinalPayment","description":"The date of the final payment defined by this asset. The amount of the                    payment, if known, could be represented by an associated value of measure type                    Cash.","source":"FpML"},{"value":"FirstPayment","description":"The date of the first payment defined by this asset. The amount of the                    payment, if known, could be represented by an associated value of measure type                    Cash.","source":"FpML"},{"value":"NextPayment","description":"The date of the next upcoming payment defined by this asset, on or after                    the valuation date. The amount of the payment, if known, could be represented by                    an associated value of measure type Cash.","source":"FpML"},{"value":"NextReset","description":"The date of the next upcoming reset in this stream, after the valuation                    date.","source":"FpML"},{"value":"PreviousPayment","description":"The date of the most recent payment defined by this asset prior to the                    valuation date. The amount of the payment could be represented by an associated                    value of measure type Cash.","source":"FpML"},{"value":"PreviousReset","description":"The date of the most recent reset in this stream, on or before the                    valuation date. The reset rate could be represented by an associated value of                    measure type MarketQuote (for an untreated rate), and/or one of measure type                    TreatedRate (for a treated rate).","source":"FpML"},{"value":"Termination","description":"The termination date of the swap leg. This is useful when the information                    is not directly included in the swap stream (for example, in certain equity                    swaps).","source":"FpML"}]}