
        
        {
        "identification" : {
        "description" : "Qualifies the link identifier allowing the trade to be associated with            other related trades. For new implementations, the use of the linkedTrade element is            preferred.",
        "codeShortId" : "linkTypeScheme",
        "version" : "1-0",
        "publicationDate" : "2019-03-25"
        },
        
        "codes" : [
        
                {
                "value" : "AllocatedFrom",
                "effectiveDate" : "2019-03-25", 
                
                "effectiveVersion" : "1-0",
                "source" : "FpML",
                "description" : "The trade id of the block trade that originated this trade in an                    allocation process. This is used by each one of the allocated trades to                    reference the block trade."
                },
                {
                "value" : "AllocatedTo",
                "effectiveDate" : "2019-03-25", 
                
                "effectiveVersion" : "1-0",
                "source" : "FpML",
                "description" : "The trade id of an allocated trade. This is used by the block trade to                    reference the trades resulting from the allocaiton process."
                },
                {
                "value" : "BackToBackFrom",
                "effectiveDate" : "2019-03-25", 
                
                "effectiveVersion" : "1-0",
                "source" : "FpML",
                "description" : "The trade id of a trade that this one was created to emulate the economic                    characteristics of. This trade is in a different legal entity from the original                    trade. Typically used as part of a prime brokerage, agency, or similar                    operation. Distinguished from MirroredFrom, in which the mirror trade is booked                    into the same legal entity (but a different book) than the original                    trade."
                },
                {
                "value" : "BackToBackTo",
                "effectiveDate" : "2019-03-25", 
                
                "effectiveVersion" : "1-0",
                "source" : "FpML",
                "description" : "The trade id of a trade that was created to emulate the economic                    characteristics of this trade. This trade is in a different legal entity from                    the original trade. Typically used as part of a prime brokerage, agency, or                    similar operation. Distinguished from MirroredTo, in which the mirror trade is                    booked into the same legal entity (but a different book) than the original                    trade."
                },
                {
                "value" : "ClearedFrom",
                "effectiveDate" : "2019-03-25", 
                
                "effectiveVersion" : "1-0",
                "source" : "FpML",
                "description" : "The ID of the trade that was submitted for clearing, from which this                    trade was created. Equivalent to originating trade for a clearing                    operation."
                },
                {
                "value" : "ClearedTo",
                "effectiveDate" : "2019-03-25", 
                
                "effectiveVersion" : "1-0",
                "source" : "FpML",
                "description" : "The trade id of a resulting trade (beta or gamma trade) that resulted                    from this trade during a clearing operation. Equivalent to resulting                    trade."
                },
                {
                "value" : "CompressedFrom",
                "effectiveDate" : "2019-03-25", 
                
                "effectiveVersion" : "1-0",
                "source" : "FpML",
                "description" : "The trade id of a trade that belonged to a portfolio that this one was                    created to emulate the characteristics of, so that portfolio trades could be                    cancelled to simplify processing. Typically in compression multiple trades that                    are similar but not necessarily identical are emulated by a single trade or                    smaller number of trades that combine the risk profile of the original                    trade."
                },
                {
                "value" : "CompressedTo",
                "effectiveDate" : "2019-03-25", 
                
                "effectiveVersion" : "1-0",
                "source" : "FpML",
                "description" : "The trade id of a trade that emulate the characteristics of a portfolio                    of trades, so that portfolio trades could be cancelled to simplify processing.                    Typically in compression multiple trades that are similar but not necessarily                    identical are emulated by a single trade or smaller number of trades that                    combine the risk profile of the original trade."
                },
                {
                "value" : "ExercisedFrom",
                "effectiveDate" : "2019-03-25", 
                
                "effectiveVersion" : "1-0",
                "source" : "FpML",
                "description" : "The ID of an option trade that was exercised to create this                    trade."
                },
                {
                "value" : "ExercisedInto",
                "effectiveDate" : "2019-03-25", 
                
                "effectiveVersion" : "1-0",
                "source" : "FpML",
                "description" : "The ID of a trade that was created from this option trade when the option                    was exercise physically."
                },
                {
                "value" : "MirroredFrom",
                "effectiveDate" : "2019-03-25", 
                
                "effectiveVersion" : "1-0",
                "source" : "FpML",
                "description" : "The trade id of a trade that this one was created to emulate the economic                    characteristics of. This trade is in then legal entity as the original trade.                    Typically used as part of a prime brokerage, agency, or similar operation.                    Distinguished from BackToBackFrom, in which the back-to-back trade is booked                    into a different legal entity from the original trade."
                },
                {
                "value" : "MirroredTo",
                "effectiveDate" : "2019-03-25", 
                
                "effectiveVersion" : "1-0",
                "source" : "FpML",
                "description" : "The trade id of a trade that was created to emulate the economic                    characteristics of this trade. This trade is in the same legal entity as the                    original trade. Typically used as part of a prime brokerage, agency, or similar                    operation. Distinguished from BackToBackTo, in which the back-to-back trade is                    booked into a different legal entity from the original trade."
                },
                {
                "value" : "NettedFrom",
                "effectiveDate" : "2019-03-25", 
                
                "effectiveVersion" : "1-0",
                "source" : "FpML",
                "description" : "The trade id of a trade that was combined with others more or less                    identical in characteristics, except possibly size and/or direction, into this                    trade. This is typically done to simplify processing."
                },
                {
                "value" : "NettedTo",
                "effectiveDate" : "2019-03-25", 
                
                "effectiveVersion" : "1-0",
                "source" : "FpML",
                "description" : "The trade id of a trade that resulted from combinining this trade with                    others that were more or less identical in characteristics, except possibly size                    and/or direction, to simplify processing."
                },
                {
                "value" : "NovatedFrom",
                "effectiveDate" : "2019-03-25", 
                
                "effectiveVersion" : "1-0",
                "source" : "FpML",
                "description" : "In a novation process, the ID of the original trade that was novated to                    create this one."
                },
                {
                "value" : "NovatedTo",
                "effectiveDate" : "2019-03-25", 
                
                "effectiveVersion" : "1-0",
                "source" : "FpML",
                "description" : "In a novation process, the ID of the new trade that was created based on                    this one."
                },
                {
                "value" : "RebookedFrom",
                "effectiveDate" : "2019-03-25", 
                
                "effectiveVersion" : "1-0",
                "source" : "FpML",
                "description" : "In a cancellation-rebooking process, the previous (cancelled) version of                    the trade."
                },
                {
                "value" : "RebookedTo",
                "effectiveDate" : "2019-03-25", 
                
                "effectiveVersion" : "1-0",
                "source" : "FpML",
                "description" : "In a cancellation-rebooking process, the replacement (rebooked) version                    of the trade."
                },
                {
                "value" : "StructureComponent",
                "effectiveDate" : "2019-03-25", 
                
                "effectiveVersion" : "1-0",
                "source" : "FpML",
                "description" : "Where a single, structured trade which is traded with a counterparty is                    decomposed into constituent trades for internal risk management, this represents                    the ID of the consitutent trade to which this structured trade is                    decomposed."
                },
                {
                "value" : "StructureMember",
                "effectiveDate" : "2019-03-25", 
                
                "effectiveVersion" : "1-0",
                "source" : "FpML",
                "description" : "Where a series of trades are grouped into a structure for trading                    purposes, this represents the trade ID of another member of that                    structure."
                },
                {
                "value" : "StructureParent",
                "effectiveDate" : "2019-03-25", 
                
                "effectiveVersion" : "1-0",
                "source" : "FpML",
                "description" : "Where a single, structured trade which is traded with a counterparty is                    decomposed into constituent trades for internal risk management, this represents                    the ID of the structured trade to which this consistuent trade                    belongs."
                }
        ]
        }
    