
        
        {
        "identification" : {
        "description" : "The pricing context field has dual usage: 1) It can be used, in a            recordkeeping submission, to explain why the trade was not publicly reported (i.e. why            there isn’t an associated public price report); or, in case the trade is publicly            reported, to explain why the public report may not reflect market price. 2)In the            context of a real-time report, the field describes why the price of a trade may not have            been representative of market price, e.g. in according with SEC SBSR requirements. In            the context of Recordkeeping, the values (ClearingForcedTrade, Clearing DefaultTrade,            Inter-Affiliate, PackageOrBespoke, PrimeBrokerage) are related to the public reporting            i.e. they indicate why the public reporting for that particular trade might not have            reflected a market price (these values mirror the values on the public report itself).            The other values available for use in recordkeeping are to provide information why the            trade was not publicly reported.",
        "codeShortId" : "pricingContextScheme",
        "version" : "2-0",
        "publicationDate" : "2016-09-16"
        },
        
        "codes" : [
        
                {
                "value" : "Allocation",
                "effectiveDate" : "2016-09-16", 
                
                "effectiveVersion" : "2-0",
                "source" : "FpML",
                "description" : "The trade was created as an allocation of a previously traded contract,                    and thus does not reflect market activity."
                },
                {
                "value" : "ClearingDefaultTrade",
                "effectiveDate" : "2016-09-16", 
                
                "effectiveVersion" : "2-0",
                "source" : "FpML",
                "description" : "Trade was triggered as a result of a clearing member firm default, and                    therefore may not reflect market price."
                },
                {
                "value" : "ClearingForcedTrade",
                "effectiveDate" : "2016-09-16", 
                
                "effectiveVersion" : "2-0",
                "source" : "FpML",
                "description" : "Trade was required by a clearing service/CCP/DCO, e.g. as a result of its                    process to determine transaction pricing from its clearing members, and                    therefore may not reflect market price."
                },
                {
                "value" : "CrossBorder",
                "effectiveDate" : "2016-09-16", 
                
                "effectiveVersion" : "2-0",
                "source" : "FpML",
                "description" : "The trade is not eligible for price reporting because (i) neither the                    direct nor indirect counterparty on either side is a US Person (ii) the SBS was                    neither executed on a platform nor accepted for clearing by a clearing agency,                    either of which has its principal place of business in the US (iii) the SBS was                    not effected by or through a registered broker-dealer (including a SBS SEF) and                    (iv) neither direct counterparty is a SBS dealing entity which has used its                    personnel or the personnel of an agent located in a US branch or office to                    arrange, negotiate or execute the SBS."
                },
                {
                "value" : "ForcedTrading",
                "effectiveDate" : "2016-09-16", 
                
                "effectiveVersion" : "2-0",
                "source" : "FpML",
                "description" : "The trade was forced to be executed for operational or risk reason and                    therefore does accurately reflect market prices."
                },
                {
                "value" : "HistoricTrade",
                "effectiveDate" : "2016-09-16", 
                
                "effectiveVersion" : "2-0",
                "source" : "FpML",
                "description" : "The trade was executed prior to the enactment of the reporting                    legislation or regulation, and therefore is not eligible for price                    disclosure."
                },
                {
                "value" : "Inter-Affiliate",
                "effectiveDate" : "2016-09-16", 
                
                "effectiveVersion" : "2-0",
                "source" : "FpML",
                "description" : "Trade was done between affiliated parties and the price may not                    accurately reflect market price."
                },
                {
                "value" : "NettingOrCompression",
                "effectiveDate" : "2016-09-16", 
                
                "effectiveVersion" : "2-0",
                "source" : "FpML",
                "description" : "Trade was created as a result of netting or compression. Applies for                    cleared SBS. (For a trade resulting from a clearing compression cycle, the code                    (along with the clearing flag) clarifies why the trade was not publicly                    disseminated.)"
                },
                {
                "value" : "PackageOrBespoke",
                "effectiveDate" : "2016-09-16", 
                
                "effectiveVersion" : "2-0",
                "source" : "FpML",
                "description" : "Trade is bespoke or part of a package so the price or individual price                    components cannot be accurately determined."
                },
                {
                "value" : "PriceReportingExemptOther",
                "effectiveDate" : "2016-09-16", 
                
                "effectiveVersion" : "2-0",
                "source" : "FpML",
                "description" : "The trade is exempt for price disclosure for reasons not otherwise                    identified."
                },
                {
                "value" : "PrimeBrokerage",
                "effectiveDate" : "2016-09-16", 
                
                "effectiveVersion" : "2-0",
                "source" : "FpML",
                "description" : "Trade was entered into as part of an arrangement with a prime                    broker."
                }
        ]
        }
    