
        
        {
        "identification" : {
        "description" : "The source from which the settlement price is to be            obtained.",
        "codeShortId" : "settlementPriceSourceScheme",
        "version" : "1-0",
        "publicationDate" : ""
        },
        
        "codes" : [
        
                {
                "value" : "Bid",
                
                
                "effectiveVersion" : "1-0",
                "source" : "FpML",
                "description" : "The bid price per share on the exchange at the valuation time on the                    valuation date"
                },
                {
                "value" : "Mid",
                
                
                "effectiveVersion" : "1-0",
                "source" : "FpML",
                "description" : "The mid-market price per share on the exchange at the valuation time on                    the valuation date"
                },
                {
                "value" : "NASDAQ",
                
                
                "effectiveVersion" : "1-0",
                "source" : "FpML",
                "description" : "An amount equal to the arithmetic average of the two prices constituting                    the Bid/Offer Spread. Bid/Offer Spread means the highest bid price per share                    and the corresponding lowest offer price per share last published prior to or at                    the expiration time on the expiration date."
                },
                {
                "value" : "Offer",
                
                
                "effectiveVersion" : "1-0",
                "source" : "FpML",
                "description" : "The offer price per share on the exchange at the valuation time on the                    valuation date"
                },
                {
                "value" : "OfficialClose",
                
                
                "effectiveVersion" : "1-0",
                "source" : "FpML",
                "description" : "(i) The published official closing price of the shares on the exchange on                    the valuation date, or (ii) the official closing level of the index, as                    published by the index sponsor, on the valuation date"
                },
                {
                "value" : "OfficialSettlement",
                
                
                "effectiveVersion" : "1-0",
                "source" : "FpML",
                "description" : "The official settlement price (however described under the rules of the                    relevant exchange or its clearing house) on maturity of any of the relevant                    exchange-traded contracts published by the exchange or its clearing house. For                    this purpose, exchange-traded contract shall mean a future or listed option                    contract on the Index whose delivery date is expected to be on the valuation                    date"
                },
                {
                "value" : "PrezzoDiRiferimento",
                
                
                "effectiveVersion" : "1-0",
                "source" : "FpML",
                "description" : "The official reference price per share quoted by the exchange on the                    exchange business day immediately prior to the expiration date equal to the                    weighted average of the last 10% traded volume on the share"
                }
        ]
        }
    