
        
        {
        "identification" : {
        "description" : "A list of reasons for withholding tax being applied to a cash            flow.",
        "codeShortId" : "withholdingTaxReasonScheme",
        "version" : "1-0",
        "publicationDate" : "2015-07-15"
        },
        
        "codes" : [
        
                {
                "value" : "Back-UpWithholding",
                "effectiveDate" : "2015-07-15", 
                
                "effectiveVersion" : "1-0",
                "source" : "FpML",
                "description" : "Tax that is levied on investment income, at an established tax rate, as                    the investor/lender withdraws it. Backup withholding helps to ensure that                    government tax-collecting agencies (such as the IRS or Canada Revenue Agency)                    will be able to receive income taxes owed to them from investors' earnings.                    Backup withholding may be applied when an investor has not met rules regarding                    taxpayer identification numbers (TIN). At the time the investor withdraws his or                    her investment income, the amount mandated by the backup withholding tax is                    remitted to the government, providing the tax-collecting body with the required                    funds immediately, but leaving the investor with less short-term cash                    flow."
                },
                {
                "value" : "Chapter3",
                "effectiveDate" : "2015-07-15", 
                
                "effectiveVersion" : "1-0",
                "source" : "FpML",
                "description" : "Chapter 3 withhholding tax applies at a rate of 30% (subject to reduction                    by treaty) to all payments of fixed or determinable annual or periodical                    (FDAP) income."
                },
                {
                "value" : "FATCA",
                "effectiveDate" : "2015-07-15", 
                
                "effectiveVersion" : "1-0",
                "source" : "FpML",
                "description" : "Chapter 4 withholding tax, Foreign Account Tax Compliance Act (FATCA),                    effective July 2014, imposes a 30% withholding tax on payments to foreign                    financial institutions that do not participate in the FATCA scheme as                    implemented in the U.S. or their home jurisdiction, as the case may be. Chapter                    4 withholding tax is not subject to reduction by treaty and the portfolio                    interest exemption is not applicable."
                },
                {
                "value" : "NonResidentAlien",
                "effectiveDate" : "2015-07-15", 
                
                "effectiveVersion" : "1-0",
                "source" : "FpML",
                "description" : "An alien is any individual who is not a U.S. citizen or U.S. national. A                    nonresident alien is an alien who has not passed the green card test or the                    substantial presence test. "
                },
                {
                "value" : "Other",
                "effectiveDate" : "2015-07-15", 
                
                "effectiveVersion" : "1-0",
                "source" : "FpML",
                "description" : "Other tax withholding reason."
                }
        ]
        }
    