

		
{
		"identification" : {
			"description" : "Contains a code representing a related party role. This can be extended toprovide custom roles.",
			"codeShortId" : "party-role",
			"version" : "4-0",
			"publicationDate" : "2024-02-15"
		},

		
		"codes" : [
		
		{
			"value" : "Accountant",
			"effectiveDate" : "2012-03-21", 
			"effectiveVersion" : "1-0",
			"source" : "FpML",
			"description" : "Organization responsible for preparing the accounting for thetrade."
		},
		{
			"value" : "AllocationAgent",
			"effectiveDate" : "2012-03-21", 
			"effectiveVersion" : "2-1",
			"source" : "FpML",
			"description" : "The organization responsible for supplying the allocations for a trade tobe allocated to multiple accounts/organizations."
		},
		{
			"value" : "ArrangingBroker",
			"effectiveDate" : "2012-03-21", 
			"effectiveVersion" : "2-1",
			"source" : "FpML",
			"description" : "The organization that arranged the trade, i.e. brought together thecounterparties. Synonyms/Alternatives: Inter-dealer broker, agent."
		},
		{
			"value" : "Beneficiary",
			"effectiveDate" : "2012-03-21", 
			"effectiveVersion" : "1-0",
			"source" : "FpML",
			"description" : "Organization that suffers the economic benefit of the trade. Thebeneficiary may be distinct from the principal/counterparty - an example occurswhen a hedge fund trades via a prime broker; in this case the principal is theprime broker, but the beneficiary is the hedge fund. This can be represented asa payer/receiver account in the name of the hedge fund, but it is also possibleto add the party role of Beneficiary at the partyTradeInformationlevel."
		},
		{
			"value" : "BookingParty",
			"effectiveDate" : "2016-06-13", 
			"effectiveVersion" : "3-6",
			"source" : "FpML",
			"description" : "The entity for which the organization supporting the trade's processinghas booked/recorded the trade. This is used in non-reporting workflowssituations in which the trade doesn't need to be reported but a firm still wantsto specify their own side."
		},
		{
			"value" : "Buyer",
			"effectiveDate" : "2016-06-13", 
			"effectiveVersion" : "3-6",
			"source" : "FpML",
			"description" : "Acquirer of the legal title to the financial instrument. In the case ofan option, the buyer is the holder of the option. In the case of a swap orforward, the buyer will be determined by industry best practice. This does notrefer to an investor or investment manager or other organization on what istypically called the Buy side; for that, see the Client role. Corresponds toBuyer as defined in certain regulations such as ESMA MiFID II/MIFIR RTS 22field 9."
		},
		{
			"value" : "BuyerDecisionMaker",
			"effectiveDate" : "2017-04-13", 
			"effectiveVersion" : "3-8",
			"source" : "FpML",
			"description" : "The party or person who, having legal authority to act on behalf of thetrade counterparty acting as Buyer as defined in this coding scheme, made thedecision to acquire the financial instrument. Corresponds to buyer decisionmaker as defined in ESMA's MIFIR RTS 23 report. This does not refer to thedecision maker for what is traditionally called the Buy side; for that, seethe Client Decision Maker role."
		},
		{
			"value" : "ClearingClient",
			"effectiveDate" : "2015-06-24", 
			"effectiveVersion" : "3-5",
			"source" : "FpML",
			"description" : "An organization that clears trades through a clearing house, via aclearing broker (member of the clearing house) who acts as an agent on itsbehalf. The term client refers to the organization's role in the clearingprocess in relation to its clearing broker, and not whether it is a price makeror taker in the execution process."
		},
		{
			"value" : "ClearingExceptionParty",
			"effectiveDate" : "2012-08-10", 
			"effectiveVersion" : "3-2",
			"source" : "FpML",
			"description" : "A party to the trade that claims a clearing exception, such as anend-user exception under Dodd-Frank Act provisions."
		},
		{
			"value" : "ClearingFirm",
			"effectiveDate" : "2012-03-21", 
			"effectiveVersion" : "2-1",
			"source" : "FpML",
			"description" : "Organization that submits the trade to a clearing house on behalf of theprincipal. Synonyms/alternates: Futures Commission Merchant (FCM), ClearingBroker, Clearing Member Firm. Some implementations use Clearing Broker assynonym."
		},
		{
			"value" : "ClearingOrganization",
			"effectiveDate" : "2012-03-21", 
			"effectiveVersion" : "2-1",
			"source" : "FpML",
			"description" : "The organization that acts as a central counterparty to clear aderivatives contract. This is used to represent the role of CentralCounterparties (CCPs) or Derivative Clearing Organizations (DCOs). Sometimescalled ClearingService. Some implementations also use the termClearer."
		},
		{
			"value" : "Client",
			"effectiveDate" : "2016-06-13", 
			"effectiveVersion" : "3-6",
			"source" : "FpML",
			"description" : "Client as defined under ESMA MIFIR. This is generally the investor orother client of an investment firm, and is synonymous with the Beneficiary inmany circumstances."
		},
		{
			"value" : "ClientDecisionMaker",
			"effectiveDate" : "2016-06-13", 
			"effectiveVersion" : "3-6",
			"source" : "FpML",
			"description" : "The party or person who, having legal authority to act on behalf of atrade counterparty, made the decision to acquire or sell the financialinstrument."
		},
		{
			"value" : "ConfirmationPlatform",
			"effectiveDate" : "2013-05-24", 
			"effectiveVersion" : "3-3",
			"source" : "FpML",
			"description" : "Organization serving as a financial intermediary for the purposes ofelectronic confirmation or providing services for post-processing oftransactional data."
		},
		{
			"value" : "ContractualParty",
			"effectiveDate" : "2014-05-06", 
			"effectiveVersion" : "3-4",
			"source" : "FpML",
			"description" : "A party to a contractual document. If the intended usage relates to thecontext of the trade lifecycle, more specific annotations have been definedwhich might be more appropriate."
		},
		{
			"value" : "CounterPartyAffiliate",
			"effectiveDate" : "2016-06-13", 
			"effectiveVersion" : "3-6",
			"source" : "FpML",
			"description" : "Organization offiially attached to the counterparty. e.g. partner,branch, subsidiary."
		},
		{
			"value" : "CounterPartyUltimateParent",
			"effectiveDate" : "2016-06-13", 
			"effectiveVersion" : "3-6",
			"source" : "FpML",
			"description" : "The topmost entity or organization, within the corporate hierarchy,responsible for the reporting party."
		},
		{
			"value" : "Counterparty",
			"effectiveDate" : "2012-03-21", 
			"effectiveVersion" : "2-1",
			"source" : "FpML",
			"description" : "An economic counterparty to the trade. Synonym: principal."
		},
		{
			"value" : "CreditSupportProvider",
			"effectiveDate" : "2012-03-21", 
			"effectiveVersion" : "1-0",
			"source" : "FpML",
			"description" : "Organization that enhances the credit of another organization (similar toguarantor, but may not fully guarantee the obligation)."
		},
		{
			"value" : "Custodian",
			"effectiveDate" : "2012-03-21", 
			"effectiveVersion" : "1-0",
			"source" : "FpML",
			"description" : "Organization that maintains custody of the asset represented by the tradeon behalf of the owner/principal."
		},
		{
			"value" : "DataSubmitter",
			"effectiveDate" : "2016-06-13", 
			"effectiveVersion" : "3-6",
			"source" : "FpML",
			"description" : "Entity submitting the transaction report to the competentauthority."
		},
		{
			"value" : "DisputingParty",
			"effectiveDate" : "2016-06-13", 
			"effectiveVersion" : "3-6",
			"source" : "FpML",
			"description" : "Organization that is disputing the trade or transaction."
		},
		{
			"value" : "DocumentRepository",
			"effectiveDate" : "2014-05-06", 
			"effectiveVersion" : "3-4",
			"source" : "FpML",
			"description" : "A marketplace organization which purpose is to maintain document records.If the intended usage relates to the context of the trade lifecycle, morespecific annotations have been defined which might be moreappropriate."
		},
		{
			"value" : "ExecutingBroker",
			"effectiveDate" : "2012-03-21", 
			"effectiveVersion" : "1-0",
			"source" : "FpML",
			"description" : "The (generally sell-side) organization that executed the trade; theprice-making party."
		},
		{
			"value" : "ExecutingEntity",
			"effectiveDate" : "2016-06-13", 
			"effectiveVersion" : "3-6",
			"source" : "FpML",
			"description" : "Entity executing the transaction. If the transaction is executed directlyby the reporting party, it will be the reporting party. If it is executed by anexecution agent or an affiliated party on behalf of the reporting party, it willbe that affiliate or agent."
		},
		{
			"value" : "ExecutionAgent",
			"effectiveDate" : "2016-06-13", 
			"effectiveVersion" : "3-6",
			"source" : "FpML",
			"description" : "The (generally buy-side) organization that acts to execute trades onbehalf of an investor. Typically this is an investment manager or asset manager,and also makes the investment decisions for the investor. If required, aseparate InvestmentDecision role can be specified to distinguish that the partymaking the investment decision is different."
		},
		{
			"value" : "ExecutionFacility",
			"effectiveDate" : "2012-03-21", 
			"effectiveVersion" : "2-1",
			"source" : "FpML",
			"description" : "The facility, exchange, or market where the trade was executed. Synonym:Swap Execution Facility, Designated Contract Market, ExecutionVenue."
		},
		{
			"value" : "Guarantor",
			"effectiveDate" : "2012-03-21", 
			"effectiveVersion" : "1-0",
			"source" : "FpML",
			"description" : "Organization that backs (guarantees) the credit risk of thetrade."
		},
		{
			"value" : "OrderTransmitter",
			"effectiveDate" : "2016-06-13", 
			"effectiveVersion" : "3-6",
			"source" : "FpML",
			"description" : "The entity transmitting the order to the reporting firm. Synonym:Transmitting Firm."
		},
		{
			"value" : "PTRRCompressionProvider",
			"effectiveDate" : "2024-02-15", 
			"effectiveVersion" : "4-0",
			"source" : "FpML",
			"description" : "A party providing a post trade risk reduction service in the form ofcompression."
		},
		{
			"value" : "PTRRRebalancingProvider",
			"effectiveDate" : "2024-02-15", 
			"effectiveVersion" : "4-0",
			"source" : "FpML",
			"description" : "A party providing a post trade risk reduction service in the form ofportfolio rebalancing."
		},
		{
			"value" : "PrimeBroker",
			"effectiveDate" : "2012-03-21", 
			"effectiveVersion" : "1-0",
			"source" : "FpML",
			"description" : "The organization that takes on or took on the credit risk for this tradeby stepping in between the two economic parties (without a central counterpartyclearing mechanism)."
		},
		{
			"value" : "PriorTradeRepository",
			"effectiveDate" : "2016-06-13", 
			"effectiveVersion" : "3-6",
			"source" : "FpML",
			"description" : "The trade repository at which the trade was reported previous to thecurrent trade repository."
		},
		{
			"value" : "PublicationVenue",
			"effectiveDate" : "2016-06-13", 
			"effectiveVersion" : "3-6",
			"source" : "FpML",
			"description" : "The reporting service (whether trade repository, market data service, orexchange/facility/venue data distribution service) that published the report ofthis trade."
		},
		{
			"value" : "ReportingParty",
			"effectiveDate" : "2012-03-21", 
			"effectiveVersion" : "2-1",
			"source" : "FpML",
			"description" : "The party with the regulatory responsibility to report thistrade."
		},
		{
			"value" : "ReportingPartyAffiliate",
			"effectiveDate" : "2016-06-13", 
			"effectiveVersion" : "3-6",
			"source" : "FpML",
			"description" : "Organization offiially attached to the reporting party e.g. partner,branch, subsidiary."
		},
		{
			"value" : "ReportingPartyUltimateParent",
			"effectiveDate" : "2016-06-13", 
			"effectiveVersion" : "3-6",
			"source" : "FpML",
			"description" : "The topmost entity or organization, within the corporate hierarchy,responsible for the reporting party."
		},
		{
			"value" : "Seller",
			"effectiveDate" : "2016-06-13", 
			"effectiveVersion" : "3-6",
			"source" : "FpML",
			"description" : "A counterparty in a trade, which performs in one of the followingcapacities: 1) it transfers or agrees to transfer in the future an instrument ortitle to that instrument in exchange for payment, 2) it writes a derivativesinstrument such as an option or a swap in which it provides risk protection tothe buyer. This does not refer to the broker/dealer or other organization onwhat is typically called the Sell side; for that, see the Executing Brokerrole. Corresponds to Seller as defined in certain regulations such as ESMAMiFID II/MIFIR RTS 22 field 16."
		},
		{
			"value" : "SellerDecisionMaker",
			"effectiveDate" : "2017-04-13", 
			"effectiveVersion" : "3-8",
			"source" : "FpML",
			"description" : "The party or person who, having legal authority to act on behalf of thetrade counterparty acting as Seller as defined in this coding scheme, made thedecision to sell the financial instrument. Corresponds to seller decisionmaker as defined in ESMA's MIFIR RTS 23 report. This does not refer to thedecision maker for what is traditionally called the Sell side; for that, seethe Trader person role."
		},
		{
			"value" : "SettlementAgent",
			"effectiveDate" : "2012-03-21", 
			"effectiveVersion" : "2-1",
			"source" : "FpML",
			"description" : "The organization that makes or receives payments on behalf of the givenprincipal party."
		},
		{
			"value" : "TradeRepository",
			"effectiveDate" : "2012-03-21", 
			"effectiveVersion" : "2-1",
			"source" : "FpML",
			"description" : "An organization that maintains records of the trade for regulatoryreporting purposes."
		},
		{
			"value" : "TradeSource",
			"effectiveDate" : "2012-03-21", 
			"effectiveVersion" : "2-1",
			"source" : "FpML",
			"description" : "The organization that originally supplied the record of the trade. In thecontext of regulatory reporting, it is the submitter of the trade record to aregulator or TR."
		},
		{
			"value" : "TradingManager",
			"effectiveDate" : "2012-03-21", 
			"effectiveVersion" : "2-1",
			"source" : "FpML",
			"description" : "The entity responsible for managing the assets/investments of this party.Synonnym: Asset Manager, Investment Manager, Trading Advisory."
		},
		{
			"value" : "TradingPartner",
			"effectiveDate" : "2012-03-21", 
			"effectiveVersion" : "2-1",
			"source" : "FpML",
			"description" : "An entity with which this party trades from time to time, ie. with whichit acts as a counterparty on some transactions. This role is used for staticreference data, not individual transactions."
		}
		]
}
	